<img src="https://i.imgur.com/JsMvGnP.pngwidth" height="30">  
<p style="color: #2e6c80; text-align: center;"><strong>

## Exercícios de SQL

Essa série de exercícios tem como objetivo o treino da utilização da biblioteca sqlite3, que permite a utilização da sintaxe de SQL para realizar queries. \
A base de dados utilizada é a [Brazilian E-Commerce Public Dataset by Olist]( https://www.kaggle.com/olistbr/brazilian-ecommerce), disponível publicamente no Kaggle. \
Sugerimos que, na medida do possível, utilize apenas queries em SQL, evitando a utilização de outras bibliotecas que nesta etapa do curso você já pode estar mais familiarizado(a). \
A exceção é a utilização do pandas quando for solicitada a visualização dos dados. \
[Documentação da sqlite3](https://docs.python.org/3/library/sqlite3.html)

Link para a base de dados: https://drive.google.com/file/d/1qfyrOegq9jJXTvSIU2yzsQvOepQCHRte/view?usp=sharing. \
Aconselhamos a baixá-la para trabalhar localmente no Jupyter Notebook. Recomendamos também salvá-la na mesma pasta em que se encontra o arquivo do Jupyter.

### Esquema 

<img src="https://i.imgur.com/Be6l4EO.png" alt="Kitten"
	title="A cute kitten" width="600" />
    
Fonte: https://www.kaggle.com/olistbr/brazilian-ecommerce

**Como funcionarão os exercícios?** \
Os primeiros exercícios terão parte do código completo. Você precisará encontrar a inscrição **...** e substituí-la por um código que realize a ação indicada. \
Exemplo: \
**0 - Importe a biblioteca numpy como np:** \
Seu código estará assim: \
```import ... as np``` \
Você deve deixá-lo assim: \
```import numpy as np``` 


A partir de um certo ponto, o código estará em branco, fazendo com que você necessite escrevê-lo integralmente.

### 1 - Importe a biblioteca necessária para realizar as queries em SQL, importe também o pandas para visualização dos dados.

In [1]:
import sqlite3 as lite
import pandas as pd

### 2 - Realize a conexão com a base de dados 'olist_ecommerce.db' que se encontra na mesma pasta deste Notebook.
Nomeie essa variável como **conn**, pois vai ser utilzada com essa nomenclatura na célula abaixo.

In [18]:
conn = lite.connect('olist_ecommerce_antiga.db')

Criamos a função auxiliar abaixo que permitirá que você se preocupe apenas com a sintaxe de SQL, uma vez que o código em Python já está resolvido. \
Para utilizá-la, basta inserir o código como um argumento da função \
Ex:```consulta('SEU CODIGO EM SQL')```

In [11]:
def consulta(query):
    cursor = conn.cursor()
    consult = cursor.execute(query)
    results = consult.fetchall()
    cols = [column[0] for column in consult.description]
    df = pd.DataFrame(results,columns=cols)
    cursor.close()
    return df

**Importante**: como é possível observar no código acima, a função já retorna os resultados da consulta como um DataFrame do pandas. Além disso, o código abaixo restringe a exibição a apenas 7 linhas para os DataFrames criados. Tal restrição é meramente estética e você pode alterá-la caso queira exibir mais linhas.

In [12]:
pd.set_option("display.max_rows",7)

### 3 - Imprima na tela o nomes de todas as tabelas contidas na base de dados.

In [19]:
consulta('''SELECT name FROM sqlite_master WHERE type='table';''')

                                 name
0             olist_customers_dataset
1           olist_geolocation_dataset
2           olist_order_items_dataset
..                                ...
5                olist_orders_dataset
6              olist_products_dataset
7   product_category_name_translation

[8 rows x 1 columns]

### 4 - Descubra informações da tabela 'olist_orders_dataset' como os nomes das colunas, os tipos de dados em cada uma delas, etc.

In [20]:
consulta('pragma table_info(olist_orders_dataset)')

    cid                           name  type  notnull dflt_value  pk
0     0                       order_id  TEXT        0       None   0
1     1                    customer_id  TEXT        0       None   0
2     2                   order_status  TEXT        0       None   0
..  ...                            ...   ...      ...        ...  ..
5     5   order_delivered_carrier_date  TEXT        0       None   0
6     6  order_delivered_customer_date  TEXT        0       None   0
7     7  order_estimated_delivery_date  TEXT        0       None   0

[8 rows x 6 columns]

### 5 - Selecione todos os dados da tabela 'olist_order_reviews_dataset'

In [21]:
consulta('SELECT * FROM olist_order_reviews_dataset')

                              review_id  ... review_answer_timestamp
0      7bc2406110b926393aa56f80a40eba40  ...     2018-01-18 21:46:59
1      80e641a11e56f04c1ad469d5645fdfde  ...     2018-03-11 03:05:13
2      228ce5500dc1d8e020d8d1322874b6f0  ...     2018-02-18 14:36:24
...                                 ...  ...                     ...
99997  1adeb9d84d72fe4e337617733eb85149  ...     2018-07-02 12:59:13
99998  be360f18f5df1e0541061c87021e6d93  ...     2017-12-16 01:29:43
99999  efe49f1d6f951dd88b51e6ccd4cc548f  ...     2017-07-03 21:01:49

[100000 rows x 7 columns]

### 6 - Selecione todos os dados da tabela 'olist_order_reviews_dataset' que tenham o score igual a 5

In [22]:
consulta('''SELECT  * 
            from olist_order_reviews_dataset
            where review_score=5 
            ''')

                              review_id  ... review_answer_timestamp
0      80e641a11e56f04c1ad469d5645fdfde  ...     2018-03-11 03:05:13
1      228ce5500dc1d8e020d8d1322874b6f0  ...     2018-02-18 14:36:24
2      e64fb393e7b32834bb789ff8bb30750e  ...     2017-04-21 22:02:06
...                                 ...  ...                     ...
57417  574ed12dd733e5fa530cfd4bbf39d7c9  ...     2018-07-14 17:18:30
57418  f3897127253a9592a73be9bdfdf4ed7a  ...     2017-12-11 20:06:42
57419  b3de70c89b1510c4cd3d0649fd302472  ...     2018-03-23 09:10:43

[57420 rows x 7 columns]

### 7 - Selecione todos os pagamentos da 'olist_order_payments_dataset' que foram realizados com cartão de crédito e possuem um valor acima de R$500.

In [23]:
consulta('''SELECT * from olist_order_payments_dataset 
             WHERE payment_value >500 
             and payment_type = "credit_card"''')

                              order_id  ...  payment_value
0     d0a945f85ba1074b60aac97ade7e240e  ...         541.00
1     2e2c60b99754ae1e4d8b18846cfec9f2  ...         542.66
2     110d9355d6338eab0a65a0cacdde5434  ...         566.40
...                                ...  ...            ...
3485  4198c92e06d92792e49f119f659e723e  ...        1294.26
3486  0f121110b75ef7c38c79d67833c49830  ...         956.86
3487  df8ab61cb615d551483618533aceb364  ...         713.65

[3488 rows x 5 columns]

### 8 - Selecione os 5 valores mais altos transacionados por cartão de crédito da 'olist_order_payments_dataset' e oredene-os de forma decrescente.

In [24]:
consulta('''SELECT * from olist_order_payments_dataset 
            WHERE payment_type = "credit_card"
            ORDER BY payment_value DESC
            LIMIT 5''')

                           order_id  ...  payment_value
0  03caa2c082116e1d31e67e9ae3700499  ...       13664.08
1  0812eb902a67711a1cb742b3cdaa65ae  ...        6929.31
2  a96610ab360d42a2e5335a3998b4718a  ...        4950.34
3  b4c4b76c642808cbe472a32b86cddc95  ...        4809.44
4  199af31afc78c699f0dbf71fb178d4d4  ...        4764.34

[5 rows x 5 columns]

### 9 - Selecione as cidades e os estados responsáveis pelos 10 valores mais altos da 'olist_order_payments_dataset'. Se quiser, mostre também os valores transacionados.

In [25]:
consulta('''
         SELECT 
         c.customer_city as cidade,
         c.customer_state as estado,
         p.payment_value as valor
         FROM olist_order_payments_dataset p
         INNER JOIN olist_orders_dataset o ON p.order_id = o.order_id
         INNER JOIN olist_customers_dataset c ON o.customer_id = c.customer_id
         ORDER BY p.payment_value DESC
         LIMIT 10
         ''')

            cidade estado     valor
0   rio de janeiro     RJ  13664.08
1       vila velha     ES   7274.88
2     campo grande     MS   6929.31
..             ...    ...       ...
7          goiania     GO   4809.44
8             maua     SP   4764.34
9      joao pessoa     PB   4681.78

[10 rows x 3 columns]

### 10  - Faça um agrupamento que mostre os estados que mais gastaram de acordo com a presente base de dados e disponha-os na tela em ordem decrescente de acordo com seus gastos.

In [26]:
consulta('''
         SELECT 
         c.customer_state as estado,
         sum(p.payment_value) as valor_total
         FROM olist_order_payments_dataset p
         INNER JOIN olist_orders_dataset o ON p.order_id = o.order_id
         INNER JOIN olist_customers_dataset c ON o.customer_id = c.customer_id
         GROUP BY 1
         ORDER BY 2 DESC
         ''')

   estado  valor_total
0      SP   5998226.96
1      RJ   2144379.69
2      MG   1872257.26
..    ...          ...
24     AC     19680.62
25     AP     16262.80
26     RR     10064.62

[27 rows x 2 columns]